In [2]:
import pandas as pd

## Defining two data-frames
data_1 = pd.DataFrame({'id': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'x': range(7)})
data_2 = pd.DataFrame({'id': ['a', 'b', 'd'], 'y': range(3)})

# Inner Join

In [3]:
data_inner = pd.merge(data_1, data_2, on = 'id', how = 'inner')
data_inner

  id  x  y
0  b  0  1
1  b  1  1
2  b  6  1
3  a  2  0
4  a  4  0
5  a  5  0

# Left Join

In [4]:
data_left = pd.merge(data_1, data_2, on = 'id', how = 'left')
data_left

  id  x    y
0  b  0  1.0
1  b  1  1.0
2  a  2  0.0
3  c  3  NaN
4  a  4  0.0
5  a  5  0.0
6  b  6  1.0

# Right Join

In [5]:
data_right = pd.merge(data_1, data_2, on = 'id', how = 'right')
data_right

  id    x  y
0  a  2.0  0
1  a  4.0  0
2  a  5.0  0
3  b  0.0  1
4  b  1.0  1
5  b  6.0  1
6  d  NaN  2

# Data Stacking

In [6]:
## Defining two data-frames
data_1 = pd.DataFrame({'id': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'x': range(7)})
data_2 = pd.DataFrame({'id': ['a', 'b', 'd'], 'x': range(3)})

data_combined = pd.concat([data_1, data_2], axis = 0)
data_combined

  id  x
0  b  0
1  b  1
2  a  2
3  c  3
4  a  4
5  a  5
6  b  6
0  a  0
1  b  1
2  d  2

# Selecting Rows Based on Conditionals

In [7]:
## Reading titanic dataset
titanic = pd.read_csv('titanic.csv')
titanic.head()

,Survived,Pclass,Name,Sex,Age,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [8]:
## Showing top two rows where sex is female
titanic[titanic['Sex'] == 'female'].head(2)

,Survived,Pclass,Name,Sex,Age,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250

In [11]:
## Filtering rows based on multiple conditions
titanic[(titanic['Sex'] == 'female') & (titanic['Age'] >= 60)]

,Survived,Pclass,Name,Sex,Age,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
273,1,1,Miss. Kornelia Theodosia Andrews,female,63.0,1,0,77.9583
364,1,1,Mrs. Frank Manley (Anna Sophia Atkinson) Warren,female,60.0,1,0,75.2500
480,1,3,Mrs. (Hedwig) Turkula,female,63.0,0,0,9.5875
561,0,3,Miss. (Marion Ogden) Meanwell,female,62.0,0,0,8.0500
825,1,1,Mrs. George Nelson (Martha Evelyn) Stone,female,62.0,0,0,80.0000

# Replacing Values

In [12]:
## Replacing female by woman
titanic['Sex'].replace('female', 'woman').head()

0     male
1    woman
2    woman
3    woman
4     male
Name: Sex, dtype: object

In [14]:
## Reaplacing female and male with woman and man
titanic['Sex'].replace(['female', 'male'], ['woman', 'man']).head()

0      man
1    woman
2    woman
3    woman
4      man
Name: Sex, dtype: object

# Renaming Columns

In [16]:
## Renaming the Pclass column
titanic.rename(columns = {'Pclass': 'Passenger Class'}).head()

,Survived,Passenger Class,Name,Sex,Age,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [17]:
## Renaming two columns
titanic.rename(columns = {'Pclass': 'Passenger Class', 'Sex': 'Gender'}).head()

,Survived,Passenger Class,Name,Gender,Age,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

# Finding the Minimum, Maximum, Sum, Average, and Count

In [18]:
## Finding maximum age
titanic['Age'].max()

80.0

In [19]:
## Finding minimum age
titanic['Age'].min()

0.42

In [20]:
## Computing average age
titanic['Age'].mean()

29.471443066516347

In [21]:
## Computing the sum of all ages
titanic['Age'].sum()

26141.17

In [22]:
## Counting the number of ages
titanic['Age'].count()

887

# Finding Unique Values

In [23]:
## Finding the unique values of sex
titanic['Sex'].unique()

array(['male', 'female'], dtype=object)

In [24]:
## Counting the number of unique values
titanic['Sex'].value_counts()

male      573
female    314
Name: Sex, dtype: int64

In [25]:
## Finding the number of unique values
titanic['Sex'].nunique()

2

# Deleting a Column

In [26]:
## Dropping the Age column
titanic.drop('Age', axis = 1).head()

,Survived,Pclass,Name,Sex,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,0,0,8.0500

In [27]:
## Dropping the Age and Sex columns
titanic.drop(['Age', 'Sex'], axis = 1).head()

,Survived,Pclass,Name,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
0,0,3,Mr. Owen Harris Braund,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,1,0,53.1000
4,0,3,Mr. William Henry Allen,0,0,8.0500

# Deleting a Row

In [28]:
## Deleting all male rows
titanic[titanic['Sex'] != 'male'].head()

,Survived,Pclass,Name,Sex,Age,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
8,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,27.0,0,2,11.1333
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708

In [29]:
## Deleting all female rows
titanic[titanic['Sex'] != 'female'].head()

,Survived,Pclass,Name,Sex,Age,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
5,0,3,Mr. James Moran,male,27.0,0,0,8.4583
6,0,1,Mr. Timothy J McCarthy,male,54.0,0,0,51.8625
7,0,3,Master. Gosta Leonard Palsson,male,2.0,3,1,21.0750

# Grouping Rows by Value

In [30]:
## Grouping rows by Sex and compute the mean of each group
titanic.groupby('Sex').mean()

,Survived,Pclass,Age,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
Sex,,,,,,
female,0.742038,2.159236,27.719745,0.694268,0.649682,44.479818
male,0.190227,2.385689,30.431361,0.432810,0.237347,25.633935

In [33]:
## Grouping rows based on Survived status, and count the rows
titanic.groupby('Survived')['Name'].count()

Survived
0    545
1    342
Name: Name, dtype: int64

# Applying a Function Over All Elements in a Column

In [34]:
## Creating a function
def uppercase(x):
    return x.upper()

## Applying the function to the Name column
titanic['Name'].apply(uppercase)

0                                 MR. OWEN HARRIS BRAUND
1      MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER) CUM...
2                                  MISS. LAINA HEIKKINEN
3            MRS. JACQUES HEATH (LILY MAY PEEL) FUTRELLE
4                                MR. WILLIAM HENRY ALLEN
                             ...
882                                 REV. JUOZAS MONTVILA
883                          MISS. MARGARET EDITH GRAHAM
884                       MISS. CATHERINE HELEN JOHNSTON
885                                 MR. KARL HOWELL BEHR
886                                   MR. PATRICK DOOLEY
Name: Name, Length: 887, dtype: object

# Applying a Function to Groups

In [36]:
## Grouping rows and then applying function to groups
titanic.groupby('Sex').apply(lambda x: x.count())

,Survived,Pclass,Name,Sex,Age,Siblings_Spouses Aboard,Parents_Children_Aboard,Fare
Sex,,,,,,,,
female,314,314,314,314,314,314,314,314
male,573,573,573,573,573,573,573,573